``` Terraform will perform the following actions:

  # aws_route53_record.beacon-galaxyproject will be created
  + resource "aws_route53_record" "beacon-galaxyproject" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "beacon.galaxyproject.eu"
      + records         = [
          + "beacon.bi.privat",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # aws_route53_record.training-vm-eu[0] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-0.eu.training.galaxyproject.eu_A"
        name    = "gat-0.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.32.152",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[1] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-1.eu.training.galaxyproject.eu_A"
        name    = "gat-1.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.35.160",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[2] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-2.eu.training.galaxyproject.eu_A"
        name    = "gat-2.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.32.234",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[3] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-3.eu.training.galaxyproject.eu_A"
        name    = "gat-3.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.35.137",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[4] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-4.eu.training.galaxyproject.eu_A"
        name    = "gat-4.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.35.133",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[5] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-5.eu.training.galaxyproject.eu_A"
        name    = "gat-5.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.34.69",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[6] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-6.eu.training.galaxyproject.eu_A"
        name    = "gat-6.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.36.91",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[7] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-7.eu.training.galaxyproject.eu_A"
        name    = "gat-7.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.36.71",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[8] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-8.eu.training.galaxyproject.eu_A"
        name    = "gat-8.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.32.164",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[9] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-9.eu.training.galaxyproject.eu_A"
        name    = "gat-9.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.34.161",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.training-vm-eu[0] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.32.152" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1bf9c2b3-460b-4206-92ba-329fbfe2ceb9" -> (known after apply)
      ~ id                  = "33b5f1ed-6610-4bde-92a3-221a35c21b6a" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "gat-0.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
      ~ user_data           = "be0dd724f242882579a44f8230827c2e779df69e" -> "f383b014e65966a276a7dee4b248cd692a5aa9fb" # forces replacement
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.32.152" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:49:0d:38" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "59342c0d-5f19-40c2-950b-b84cc1bcc591" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[1] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.35.160" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1bf9c2b3-460b-4206-92ba-329fbfe2ceb9" -> (known after apply)
      ~ id                  = "a828eeb2-288f-4746-bce6-928c137887b2" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "gat-1.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
      ~ user_data           = "be381fe8187ba0caf30a1d0ccb3a0eb64e286833" -> "cb0a49126a1a18f9813bf51a660034fcc45ce3f6" # forces replacement
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.35.160" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:94:c2:c8" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "59342c0d-5f19-40c2-950b-b84cc1bcc591" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[2] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.32.234" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1bf9c2b3-460b-4206-92ba-329fbfe2ceb9" -> (known after apply)
      ~ id                  = "9360a69c-74f7-427d-92ed-4e7ff9e78e1e" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "gat-2.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
      ~ user_data           = "2f3d45d4a9a0abd28b6dce33c40d321b3cd1780a" -> "4e44e9cc6467f6828d304076c4461da839c72729" # forces replacement
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.32.234" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:39:41:05" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "59342c0d-5f19-40c2-950b-b84cc1bcc591" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[3] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.35.137" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1bf9c2b3-460b-4206-92ba-329fbfe2ceb9" -> (known after apply)
      ~ id                  = "96a0803e-dc0d-4af7-9efc-4d0ce203bc4e" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "gat-3.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
      ~ user_data           = "cdad14f42a41de490dca30db8da7d9cd53615435" -> "efdc1e6734972167972fb800345284c4a71d7d15" # forces replacement
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.35.137" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:49:3c:97" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "59342c0d-5f19-40c2-950b-b84cc1bcc591" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[4] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.35.133" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1bf9c2b3-460b-4206-92ba-329fbfe2ceb9" -> (known after apply)
      ~ id                  = "8a3d8a00-0a64-4f51-9b1a-dc567d7dc77b" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "gat-4.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
      ~ user_data           = "c8642edb516eb61a1e601188211e4bbcba30fb01" -> "e1b65121ff566c3b1be41e1088ae78a82f9acaf7" # forces replacement
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.35.133" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:8c:93:44" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "59342c0d-5f19-40c2-950b-b84cc1bcc591" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[5] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.34.69" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1bf9c2b3-460b-4206-92ba-329fbfe2ceb9" -> (known after apply)
      ~ id                  = "d5b73b60-f308-44a6-992e-3ada02bfd047" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "gat-5.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
      ~ user_data           = "7c2467473621f8d0fac6361242faa04252fef087" -> "2163db1061c903ec96ff9d3b8612ee8fdc2031e0" # forces replacement
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.34.69" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:2c:5f:a1" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "59342c0d-5f19-40c2-950b-b84cc1bcc591" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[6] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.36.91" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1bf9c2b3-460b-4206-92ba-329fbfe2ceb9" -> (known after apply)
      ~ id                  = "796a1955-7619-45e7-b6ac-9dcb3d748870" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "gat-6.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
      ~ user_data           = "336135678ca0190ee7400fe1331581043d9748e3" -> "feb7b1fa624dd91ab3697a8f2e2c8de8bf0485c5" # forces replacement
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.36.91" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:6f:ec:c8" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "59342c0d-5f19-40c2-950b-b84cc1bcc591" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[7] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.36.71" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1bf9c2b3-460b-4206-92ba-329fbfe2ceb9" -> (known after apply)
      ~ id                  = "a9cf2131-bbd6-403f-ba20-bb409725da68" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "gat-7.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
      ~ user_data           = "896bd903cc5296aa249f23d79e6ae0441979bdb5" -> "61261dfd0327d8fda3c202d461fcfd5f1ad53b82" # forces replacement
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.36.71" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:41:4a:78" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "59342c0d-5f19-40c2-950b-b84cc1bcc591" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[8] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.32.164" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1bf9c2b3-460b-4206-92ba-329fbfe2ceb9" -> (known after apply)
      ~ id                  = "c7ee5fe1-5963-459e-9bdf-b345a2932522" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "gat-8.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
      ~ user_data           = "d48066902831793dc9dd330befdb89590e629e96" -> "2b3f4b4a7e279589d78420bb3cae69564cbc7dca" # forces replacement
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.32.164" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:67:85:dd" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "59342c0d-5f19-40c2-950b-b84cc1bcc591" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[9] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.34.161" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1bf9c2b3-460b-4206-92ba-329fbfe2ceb9" -> (known after apply)
      ~ id                  = "5edefb04-c26f-4dbc-a8e2-57c16809b9a3" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "gat-9.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
      ~ user_data           = "f7063070eb34c1ed2088205746e16540df463b04" -> "744f0cb63706e839eed8025eee9254bb2ceea6f7" # forces replacement
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.34.161" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:8b:77:60" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "59342c0d-5f19-40c2-950b-b84cc1bcc591" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 11 to add, 10 to change, 10 to destroy.

Changes to Outputs:
  ~ training_ips-eu = [
      - [
          - "192.52.32.152",
          - "192.52.35.160",
          - "192.52.32.234",
          - "192.52.35.137",
          - "192.52.35.133",
          - "192.52.34.69",
          - "192.52.36.91",
          - "192.52.36.71",
          - "192.52.32.164",
          - "192.52.34.161",
        ],
      + [
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```